ПредопределенныеЗначенияПодсистема/src/Enums/ТипыЗначенияПредопределенныхЗначений/ТипыЗначенияПредопределенныхЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗначенияПредопределенныхЗначений</name>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Массив</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Ссылка</name>
  </enumValues>
  <enumValues>
    <name>КлючЗначение</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаЗначений</name>
  </enumValues>
  <enumValues>
    <name>КаталогПредопределенныхНастроек</name>
    <comment>Группа настроек, без установки значения</comment>
  </enumValues>
</mdclass:Enum>

ПредопределенныеЗначенияПодсистема/src/CommonModules/ПредопределенныеНастройкиПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура заполняет таблицу предопределенных настроек значением версии подсистемы.
//
// Параметры:
// 	ТаблицаНастроек - ТаблицаЗначений - Таблица в которую будут добавляться предопределенные настройки.
//
Процедура ПриЗаполненииТаблицыПредопределенныхНастроек(ТаблицаНастроек) Экспорт
	
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("87548614-5423-299a-af9c-a08e5ca86056");;
	НоваяНастройка.Наименование = НСтр("ru ='Версия подсистемы'");
	НоваяНастройка.ИмяНастройки	= "ВерсияПодсистемы";
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка");
	НоваяНастройка.Описание = НСтр("ru ='Информация о версии текущей подсистемы.'");
	НоваяНастройка.Значение	= "1.0.0";
	
		// Булева настройка
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("bfc480f2-023e-40d3-ab52-fecb853edf3c");
	НоваяНастройка.ИмяНастройки = "ВключеноРегистрирование";
	НоваяНастройка.Наименование = НСтр("ru ='Регистрация событий включена'");
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево");
	НоваяНастройка.Описание = НСтр("ru ='Разрешает регистрацию событий в системе.'");
	НоваяНастройка.Значение = Ложь;
	
	// Настройка с массивом
	НоваяНастройка = ТаблицаНастроек.Добавить();
	НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("6f205348-2c73-46a8-98a6-851a40a12bbe");
	НоваяНастройка.ИмяНастройки = "РазрешенныеПользователи";
	НоваяНастройка.Наименование = НСтр("ru ='Разрешенные пользователи'");
	НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Массив");
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить("Администратор");
	МассивПользователей.Добавить("Аудит");
	
	НоваяНастройка.Значение = МассивПользователей;

НоваяНастройка = ТаблицаНастроек.Добавить();
НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("b9528a97-5605-4b8e-9ad7-e48f383091ec");
НоваяНастройка.ИмяНастройки = "URL_API";
НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Строка");
НоваяНастройка.Значение = "https://api.example.com";

НоваяНастройка = ТаблицаНастроек.Добавить();
НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("e221d50e-972a-4025-9b6d-9c8b7d822253");
НоваяНастройка.ИмяНастройки = "РазрешенаОтладка";
НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Булево");
НоваяНастройка.Значение = Ложь;

НоваяНастройка = ТаблицаНастроек.Добавить();
НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("09384e92-8c9b-406f-8817-a048e037490f");
НоваяНастройка.ИмяНастройки = "ДатаОбновления";
НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.Дата");
НоваяНастройка.Значение = ТекущаяДата();

НоваяНастройка = ТаблицаНастроек.Добавить();
НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("dbe34f15-0923-4eac-b991-79abb20f5ce8");
НоваяНастройка.ИмяНастройки = "НастройкиИнтеграции";
НоваяНастройка.ТипЗначения = ПредопределенноеЗначение("Перечисление.ТипыЗначенияПредопределенныхЗначений.КлючЗначение");

СоответствиеНастроек = Новый Соответствие;
СоответствиеНастроек.Вставить("URL", "https://api.example.com");
СоответствиеНастроек.Вставить("Token", "secret123");
СоответствиеНастроек.Вставить("Timeout", 30);

НоваяНастройка.Значение = СоответствиеНастроек;

КонецПроцедуры

#КонецОбласти
